In [2]:
import pandas as pd

data = [10,20,30,40]

print(pd.Series(data))

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
data = {"a":1,"b" : 2,"c" : 3}
print(pd.Series(data))

a    1
b    2
c    3
dtype: int64

In [4]:
df.head(1)

NameError: name 'df' is not defined

In [ ]:
df.tail(1)

      Name  Age
1  Anubhav   13

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   Age     2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes

In [ ]:
df.describe()

             Age
count   2.000000
mean   12.500000
std     0.707107
min    12.000000
25%    12.250000
50%    12.500000
75%    12.750000
max    13.000000

In [ ]:
df["Age"]

0    12
1    13
Name: Age, dtype: int64

In [ ]:
df.Age

0    12
1    13
Name: Age, dtype: int64

In [ ]:
df.Age.max()

13

In [ ]:
df.T

          0        1
Name  Kumar  Anubhav
Age      12       13

In [8]:
df = pd.read_csv("synthetic_medicine_inventory_data1.csv")
df

       Unnamed: 0  Amount  Consume Necessity  Days
0               0     152       17       Low    10
1               1     485       23       Low    18
2               2     910       28       Low    28
3               3     320       22    Medium    15
4               4     156       21    Medium     3
...           ...     ...      ...       ...   ...
14364       14364      70       17      High     5
14365       14365     154       31    Medium     1
14366       14366     627        4      High   146
14367       14367     492        8       Low    62
14368       14368     824       27      High    31

[14369 rows x 5 columns]

In [9]:
df.dtypes

Unnamed: 0     int64
Amount         int64
Consume        int64
Necessity     object
Days           int64
dtype: object

In [ ]:
df[df["Amount"]]

Empty DataFrame
Columns: [Unnamed: 0, Amount, Consume, Necessity, Days]
Index: []

In [ ]:
df[["Amount",'Consume']].mean()

Amount     530.117127
Consume     25.551535
dtype: float64

In [19]:
df[["Amount","Consume"]].groupby("Amount").mean()

          Consume
Amount
50      24.428571
51      23.076923
52      27.125000
53      27.000000
54      13.333333
...           ...
996     25.894737
997     25.285714
998     20.444444
999     27.882353
1000    26.714286

[951 rows x 1 columns]